{
  "documentTitle": "Malaysia Islands and Beaches",
  "documentType": "Travel Brochure",
  "publisher": "Tourism Malaysia",
  "publicationDate": "December 2023",
  "introduction": {
    "title": "SELAMAT DATANG",
    "subtitle": "COME EXPERIENCE THE ENCHANTMENT OF MALAYSIA'S IDYLLIC ISLANDS AND GOLDEN BEACHES",
    [cite_start]"body": "Malaysia, a land of friendly people and a nation blessed with natural wonders, welcomes you. [cite: 3] [cite_start]Bordered by Thailand in the north and Singapore in the south, Malaysia also stretches across the northern tier of Borneo to form the states of Sabah and Sarawak. [cite: 4] [cite_start]With 4,800km of coastline, Malaysia boasts some of the most beautiful islands and beaches in Asia. [cite: 5] [cite_start]Surrounded by the Straits of Malacca, the Andaman Sea, the South China Sea, the Sulu Sea and the Celebes Sea, the country has an amazing number of natural treasures that lay nestled in tranquil bays and coves. [cite: 6] [cite_start]Beneath the aquamarine waters are a fascinating world of corals and marine life waiting to be discovered. [cite: 7] [cite_start]Come and be mesmerised by these fabulous holiday retreats. [cite: 8]"
  },
  "destinations": [
    {
      "name": "Langkawi, Kedah",
      [cite_start]"slogan": "WORLD-RENOWNED LANGKAWI BECKONS WITH SUN-KISSED BEACHES, CLEAR BLUE SKIES AND THE MARVELS OF NATURE. [cite: 11]",
      [cite_start]"description": "Langkawi is the largest of a multitude of islands that lie off the coast of Kedah state, in the far northwest of Peninsular Malaysia. [cite: 12] The island comprises a archipelago of 99 islands. [cite_start]Langkawi is a versatile holiday destination with world-class infrastructure and facilities - a modern international airport, excellent roads, state-of-the-art marinas, a wide range of accommodation options from budget hotels to award-winning luxurious resorts, superb golf courses and a host of recreational activities. [cite: 13] [cite_start]Visitors arriving by sea will disembark at the jetty in the main town of Kuah. [cite: 14] [cite_start]Located southeast of the island, the town houses many hotels and shopping centres. [cite: 15]",
      "attractions": [
        {
          "name": "Eagle Square",
          [cite_start]"description": "A large prominent statue of an eagle, situated at the popular Eagle Square, is visible from afar when approaching the island. [cite: 16] [cite_start]According to local folklore, Langkawi derived its name from the eagle or helang (lang). [cite: 17]"
        },
        {
          "name": "Tanjung Rhu Beach",
          [cite_start]"description": "Tanjung Rhu Beach, 22 km north of Kuah, is fringed by casuarinas from where the beach gets its name. [cite: 19] [cite_start]A perfect place for a picnic, this wide sandy beach offers unmatched pristine tranquility. [cite: 20] [cite_start]The sunset here at dusk, in a blaze of orange and red, is a truly spectacular sight. [cite: 21]"
        },
        {
          "name": "Western Coastline Beaches (Datai, Kok, Burau Bay, Tengah)",
          [cite_start]"description": "On the western coastline of Langkawi lie the beaches of Datai, Kok, Burau Bay and Tengah. [cite: 22] [cite_start]Kok Beach is the location of Telaga Harbour Park, a marina-cum-resort with ample facilities. [cite: 25] [cite_start]Chenang Beach is approximately 7km from Langkawi International Airport and is the most developed of the beach areas housing several luxury-class hotels and dozens of budget chalets and restaurants. [cite: 26]"
        },
        {
          "name": "Payar Island Marine Park",
          [cite_start]"description": "Go snorkelling and diving in the Payar Island Marine Park, 19 nautical miles south of Langkawi. [cite: 30] [cite_start]Segantang Island, Kaca Island and Lembu Island are other islands that make up the Marine Park. [cite: 31]"
        },
        {
          "name": "Underwater World Langkawi",
          [cite_start]"description": "One of the largest public aquariums in the country, it features stingrays, sharks, moray eels and green turtles together with exotic fishes and sea plants. [cite: 37]"
        }
      ],
      "activities": [
        [cite_start]"Golf at Datai Bay [cite: 23]",
        [cite_start]"Horseback riding at Burau Bay [cite: 24]",
        [cite_start]"Island hopping from Tengah Beach [cite: 24]",
        [cite_start]"Water sports at Chenang Beach [cite: 27]",
        [cite_start]"Snorkelling and diving [cite: 30]",
        [cite_start]"Glass-bottomed boat rides [cite: 32]",
        [cite_start]"Batik-painting workshops [cite: 39]",
        [cite_start]"Relaxing spa massages [cite: 40]",
        [cite_start]"Duty-free shopping [cite: 41, 42]"
      ],
      "gettingThere": {
        [cite_start]"byRoad": "Visitors travelling by road will have to drive to Kuala Kedah or Kuala Perlis, the main jumping-off points by ferry to Langkawi. [cite: 43] [cite_start]Regular, air-conditioned buses are available from Kuala Lumpur to Kuala Perlis. [cite: 44] [cite_start]Visitors to Kuala Kedah can disembark in Alor Setar and proceed to Kuala Kedah Jetty by bus or taxi. [cite: 45] [cite_start]The journey to Kuala Kedah takes about six hours while Kuala Perlis is another hour away. [cite: 46]",
        [cite_start]"byAir": "Malaysia Airlines provides direct air services from the Kuala Lumpur International Airport (KLIA) to Langkawi. [cite: 47] [cite_start]Alternatively, visitors can fly via AirAsia, Malindo Air and Firefly. [cite: 48] [cite_start]AirAsia operates from the Kuala Lumpur International Airport 2 (KLIA 2) in Sepang while Firefly operates from the Sultan Abdul Aziz Shah Airport in Subang. [cite: 49] [cite_start]Malindo Air operates from both Sepang and Subang, while Scoot Air operates flights to Langkawi from Singapore. [cite: 50]",
        [cite_start]"byRail": "The KTM rail service provides fast and comfortable electronic trains from Kuala Lumpur to Alor Setar in Kedah. [cite: 51] [cite_start]Upon disembarking in Alor Setar, visitors can take a bus or taxi to Kuala Kedah for the ferry to Langkawi. [cite: 52] [cite_start]In addition to the electronic train, the regular train service also connects visitors from Kuala Lumpur to Arau in Perlis. [cite: 53] [cite_start]From Arau, taxis and buses are available to Kuala Perlis, another jumping-off point to Langkawi. [cite: 54]",
        [cite_start]"bySea": "Express ferries provide daily services to Langkawi from both Kuala Kedah and Kuala Perlis. [cite: 55] [cite_start]The journey takes about 1 hour 30 minutes and 1 hour respectively. [cite: 56] [cite_start]From Penang to Langkawi, the ferry takes 2 hours 30 minutes. [cite: 57] [cite_start]The island is also a stopover for Star Cruises, one of the largest luxury cruise lines in the world. [cite: 58]"
      },
      "usefulContacts": [
        {
          "name": "Tourism Malaysia Tourist Information Centre, Langkawi International Airport",
          "phone": "604 955 7155"
        },
        {
          "name": "Tourism Malaysia Tourist Information Centre, Kompleks Jetty Point, Kuah Jetty",
          "phone": "604 966 0494"
        }
      ]
    },
    {
      "name": "Penang",
      [cite_start]"slogan": "LOVELY BEACH RESORTS, OLD-WORLD CHARM AND COLOURFUL CULTURES GIVE PENANG ITS ALLURE. [cite: 60] [cite_start]AN ISLAND PARADISE IN FULL BLOOM, IT IS APPLY HAILED AS THE PEARL OF THE ORIENT. [cite: 61]",
      "description": "Penang is one of Malaysia's most famous resort destinations. [cite_start]The state consists of Penang Island and a strip on the mainland known as Seberang Perai. [cite: 62] [cite_start]George Town, its capital, is a UNESCO World Heritage City with fascinating historical buildings and cultural landmarks. [cite: 63] [cite_start]Penang's northern shoreline, characterised by expansive stretches of golden sand and glittering waters, is a popular holiday spot for foreign and local visitors alike. [cite: 64]",
      "attractions": [
        {
          "name": "Batu Feringghi",
          [cite_start]"description": "Situated along the coastal road northwest of George Town, is the most popular beach in Penang, lined with a string of international-standard hotels and resorts. [cite: 65] [cite_start]As the sun sets, Batu Feringghi comes alive with a carnival-like atmosphere with an open-air bazaar. [cite: 68]"
        },
        {
          "name": "Tanjung Bungah",
          [cite_start]"description": "Another popular beach in Penang with numerous luxury resorts. [cite: 71] [cite_start]The most charming feature of Tanjung Bungah is its many secluded coves. [cite: 72]"
        },
        {
          "name": "Teluk Bahang",
          [cite_start]"description": "Its idyllic beach offers a solitary luxury hotel promising a tranquil ambience for those who prefer privacy. [cite: 74]"
        },
        {
          "name": "Tropical Spice Garden",
          [cite_start]"description": "A living collection of more than 500 varieties of flora from Malaysia and around the world. [cite: 75]"
        },
        {
          "name": "Penang National Park Beaches (Monkey Beach, Kerachut Beach)",
          [cite_start]"description": "Situated in Penang's National Park, these pristine beaches make for excellent excursions to get a glimpse into the vast variety of the island's flora and fauna. [cite: 78] [cite_start]Monkey Beach is ideal for quiet picnics. [cite: 79] [cite_start]Kerachut Beach offers an unspoilt environment and picturesque views. [cite: 81]"
        },
        {
          "name": "George Town",
          [cite_start]"description": "The Esplanade and Karpal Singh Drive in George Town are delightful seafronts for an evening stroll. [cite: 86] [cite_start]Not to be missed when visiting this island are the spectacular street art and wrought-iron markers scattered around the heritage city. [cite: 90]"
        }
      ],
      "activities": [
        [cite_start]"Aquatic thrills like banana boat rides, canoeing, jet-skiing, and parasailing. [cite: 66, 67]",
        [cite_start]"Shopping at the Feringghi Walk open-air bazaar. [cite: 70]",
        [cite_start]"Jungle trekking and birdwatching. [cite: 80, 84]",
        [cite_start]"City tours and enjoying local delicacies at Gurney Drive. [cite: 85, 88]",
        [cite_start]"Shopping for souvenirs and antiques in Little India and Campbell Street. [cite: 89]"
      ],
      "gettingThere": {
        [cite_start]"byRoad": "The Penang Bridge and the Sultan Abdul Halim Muadzam Shah Bridge connect Penang Island to the mainland. [cite: 91] [cite_start]A toll is levied on the mainland's side of the bridge. [cite: 92] [cite_start]Buses to Penang are available from most parts of the country. [cite: 93]",
        [cite_start]"byAir": "Malaysia Airlines operates direct air services to Penang from the Kuala Lumpur International Airport (KLIA). [cite: 93] [cite_start]Budget carriers like AirAsia, Firefly, and Malindo Air also fly to Penang from various domestic and international destinations. [cite: 94, 95, 96, 97]",
        [cite_start]"byRail": "KTM or Malayan Railway provides train services to Butterworth from various locations including Kuala Lumpur and Bangkok. [cite: 98]",
        "bySea": "Ferry services are also available from Langkawi. [cite_start]The journey takes around 2 hours and 30 minutes. [cite: 99] [cite_start]Penang is a stopover for the luxury cruise line, Star Cruises. [cite: 100]"
      },
      "usefulContacts": [
        {
          "name": "Tourism Malaysia Northern Region",
          "phone": "604 261 0058"
        }
      ]
    },
    {
      "name": "Pangkor, Perak",
      [cite_start]"slogan": "LYING OFF PERAK ON THE WEST COAST OF PENINSULAR MALAYSIA, THIS TRANQUIL ISLAND WITH ITS WHITE SANDY BEACHES AND CHARMING FISHING VILLAGES WILL ENTHRALL YOU. [cite: 101]",
      [cite_start]"description": "Pangkor's main attractions are undoubtedly the wonderful offerings of its pristine beaches on the western coastline. [cite: 104] [cite_start]Lumut is the staging point to Pangkor if arriving by road or rail. [cite: 117]",
      "attractions": [
        {
          "name": "Pasir Bogak Beach",
          [cite_start]"description": "A snorkelling site with an extensive reef and shallow waters, faces the channel between Pangkor and Pangkor Laut. [cite: 105]"
        },
        {
          "name": "Teluk Nipah",
          [cite_start]"description": "A place where tourists can enjoy both solitude and excitement by the beach. [cite: 108]"
        },
        {
          "name": "Giam Island",
          [cite_start]"description": "A walk across to Giam Island at low tide will reward you with a treasure trove of marine life. [cite: 110]"
        },
        {
          "name": "Pangkor Laut",
          [cite_start]"description": "A world-renowned tropical island destination, this privately-owned island resort boasts one of the finest beaches in the Straits of Malacca. [cite: 113] [cite_start]It houses an exclusive resort with a luxurious Spa Village. [cite: 115, 116]"
        }
      ],
      "activities": [
        [cite_start]"Snorkelling and beachcombing at Pasir Bogak Beach. [cite: 105, 107]",
        [cite_start]"Kayaking and enjoying fresh seafood in Pangkor town. [cite: 107, 112]",
        [cite_start]"Sunset cruises and romantic dinners at Pangkor Laut. [cite: 114]"
      ],
      "gettingThere": {
        [cite_start]"byRoad": "Lumut is a 4-hour drive from Kuala Lumpur via the North-South Highway. [cite: 121] [cite_start]It can be reached by taxi or bus from Ipoh, Kuala Lumpur or Butterworth. [cite: 122]",
        [cite_start]"bySea": "Pangkor can be accessed via a 30-minute boat ride from Lumut Jetty [cite: 123] [cite_start]or a 10-minute ferry ride from Marina Island Jetty Complex. [cite: 124]"
      }
    },
    {
      "name": "Port Dickson, Negeri Sembilan",
      [cite_start]"slogan": "PORT DICKSON IS THE MOST POPULAR BEACH IN PENINSULAR MALAYSIA'S WEST COAST. [cite: 126]",
      [cite_start]"description": "Port Dickson, or fondly known as PD, is the pride of Negeri Sembilan. [cite: 128] [cite_start]It has an almost unbroken coastline stretching up to 18km. [cite: 130]",
      "attractions": [
        {
          "name": "Beaches (Teluk Kemang, Tanjung Tuan, Saujana, Cahaya, Blue Lagoon)",
          [cite_start]"description": "Popular tourist spots with sunny beaches lined by tall palm trees and shady casuarinas. [cite: 131, 132] [cite_start]Teluk Kemang is one of the longest stretches, and the Blue Lagoon offers an undisturbed setting. [cite: 133, 135]"
        },
        {
          "name": "Cape Rachado (Tanjung Tuan) Lighthouse",
          [cite_start]"description": "Built in the 16th century, this lighthouse was used to guide vessels sailing to Melaka. [cite: 143] [cite_start]Enjoy breathtaking views of the coastline from this vantage point. [cite: 144]"
        },
        {
          "name": "Lukut Fort and Museum",
          [cite_start]"description": "Erected to protect the tin-rich town of Lukut, the museum here offers glimpses of the town's history. [cite: 145, 146]"
        }
      ],
      "activities": [
        [cite_start]"Canoeing, parasailing, yachting, and speed boat rides. [cite: 134]",
        [cite_start]"Competitive sailing. [cite: 138]",
        [cite_start]"Camping by the beach. [cite: 137]",
        [cite_start]"Attending the annual Raptor Watch event. [cite: 136]"
      ],
      "gettingThere": {
        [cite_start]"byRoad": "Port Dickson is located along the coastal road an hour's drive from Seremban. [cite: 147] [cite_start]Seremban is about 90 km south of Kuala Lumpur on the North-South Expressway. [cite: 148] [cite_start]Regular bus and taxi services connect Port Dickson to Kuala Lumpur and Seremban. [cite: 149]",
        [cite_start]"byRail": "Rail travelers have to disembark in Seremban which is serviced by KTM Komuter and ETS trains from Kuala Lumpur. [cite: 149]"
      }
    },
    {
      "name": "Islands of Johor",
      [cite_start]"slogan": "THE MAGICAL ISLANDS OF JOHOR ARE ENDOWED WITH CRYSTAL CLEAR WATERS, POWDERY WHITE SAND AND COLOURFUL MARINE LIFE. [cite: 150]",
      [cite_start]"description": "Located off the coast of Mersing, the Sultan Iskandar Marine Park is made up of 13 islands in six island clusters. [cite: 154] [cite_start]Snorkelling and scuba diving are the main activities here. [cite: 155] [cite_start]Mersing is the main staging point to Johor's islands. [cite: 176]",
      "attractions": [
        {
          "name": "Sibu Group of Islands",
          [cite_start]"description": "Lush vegetation and endless stretches of golden beaches characterise the Sibu Group of Islands. [cite: 159] [cite_start]Accessible from the Tanjung Leman jetty. [cite: 160]"
        },
        {
          "name": "Rawa Island",
          [cite_start]"description": "Famed for its tall palm trees, white sand and secluded coves, this is the ideal tropical getaway. [cite: 165]"
        },
        {
          "name": "Pemanggil Island",
          "description": "The largest among the cluster of islands of Johor. [cite_start]Squid fishing is an enjoyable seasonal sport here. [cite: 167]"
        },
        {
          "name": "Desaru",
          [cite_start]"description": "A popular seaside destination on the mainland that commands a magnificent view of South China Sea, and boasts 25km of inviting beaches. [cite: 171]"
        }
      ],
      "activities": [
        [cite_start]"Snorkelling, scuba diving, windsurfing, sailing, kayaking. [cite: 155, 161, 164]",
        [cite_start]"Jungle hiking and visiting a 'kelong' (offshore fishing platform). [cite: 162, 163]",
        [cite_start]"Squid fishing. [cite: 167]",
        [cite_start]"Flying an ultra-light aircraft or go-kart racing in Desaru. [cite: 173]"
      ],
      "gettingThere": {
        [cite_start]"byRoad": "From Kuala Lumpur, drive along the North-South Expressway and exit in Kluang to get to either Mersing or Tanjung Leman. [cite: 180] [cite_start]The drive to Mersing from Kuala Lumpur takes about four hours. [cite: 182] [cite_start]Overnight buses are available from Kuala Lumpur. [cite: 183]",
        "byRail": "KTM has rail services from Kuala Lumpur to Kluang. [cite_start]From Kluang, public transportation is available to the jetty. [cite: 185]"
      },
      "usefulContacts": [
        {
          "name": "Tourism Malaysia Tourist Information Centre, Sultan Iskandar Building",
          "phone": "607 227 0822/1822"
        },
        {
          "name": "Tourism Malaysia Tourist Information Centre, JB Sentral",
          "phone": "607 224 4133"
        }
      ]
    },
    {
      "name": "Tioman, Pahang",
      [cite_start]"slogan": "HAILED AS ONE OF THE BEST ISLAND GETAWAYS IN THE WORLD, TIOMAN IS FAMED AS THE SETTING FOR 'BALI HAI' IN THE HOLLYWOOD MUSICAL, SOUTH PACIFIC. [cite: 187]",
      "description": "Tioman is the largest and most developed of the volcanic islands that form the Tioman Marine Park. [cite_start]According to legend, the island is the final resting place of a beautiful dragon princess. [cite: 187] The waters around Tioman are ideal for water sports. [cite_start]Its warm waters and good visibility make it a paradise for underwater explorations. [cite: 188]",
      "attractions": [
        {
          "name": "Villages (Salang, Tekek, Genting, Paya, Juara)",
          [cite_start]"description": "There are several villages scattered around the island's coastline, each offering a different atmosphere. [cite: 193] [cite_start]Salang is popular for its clear waters and corals. [cite: 195] [cite_start]Tekek is the gateway to Tioman. [cite: 199] [cite_start]Genting has a serene and rustic atmosphere. [cite: 201] [cite_start]Juara is a secluded hideaway with a wide beach. [cite: 203]"
        },
        {
          "name": "Underwater World",
          [cite_start]"description": "Discover astounding sights such as colourful gorgonian sea fans, staghorn corals, and various marine life like Napoleon fish, bumphead parrotfish, and harmless black-tip sharks. [cite: 188, 189, 191]"
        },
        {
          "name": "Twin Peaks (Dragon's Horns)",
          [cite_start]"description": "Towering against the skyline of Mukut village, this is an unmistakable landmark of the island. [cite: 205]"
        }
      ],
      "activities": [
        [cite_start]"Swimming, boating, kayaking, windsurfing. [cite: 188]",
        [cite_start]"Diving and snorkelling. [cite: 188, 191]",
        [cite_start]"Boat rides to Monkey Beach or uninhabited islands. [cite: 192]",
        [cite_start]"Camping. [cite: 203]"
      ],
      "gettingThere": {
        [cite_start]"byRoad": "Teluk Gading in Pahang and Mersing in Johor are two take-off points to Tioman. [cite: 206] [cite_start]Teluk Gading is a 3.5 hours' drive from KL. [cite: 207] [cite_start]Direct buses are available from KL to Teluk Gading and Mersing. [cite: 210, 211]",
        [cite_start]"byAir": "SKS Airways will fly to Tioman from Sultan Abdul Aziz Shah Airport in Subang starting March 2022. [cite: 213]",
        "bySea": "The island is accessible by boat from the jetties in Teluk Gading and Mersing. [cite_start]The ride takes about 1 hour and 30 minutes. [cite: 214]"
      }
    },
    {
      "name": "Cherating, Pahang",
      [cite_start]"slogan": "ASIA'S FIRST CLUB MED AND THE NOCTURNAL RITUAL OF TURTLE NESTING GIVE CHERATING ITS APPEAL. [cite: 215]",
      [cite_start]"description": "The calm blue waters of the South China Sea make Cherating one of the most alluring beach resorts in Malaysia. [cite: 217] [cite_start]Located 47km north of the capital of Pahang, Kuantan, Cherating is home to the world-famous Club Med. [cite: 218]",
      "attractions": [
        {
          "name": "Chendor Beach Turtle Sanctuary",
          "description": "A favourite spot for turtle watching. [cite_start]During the nesting period, turtles come to lay eggs at its turtle sanctuary. [cite: 223, 224]"
        },
        {
          "name": "Cherating Village",
          [cite_start]"description": "Experience the rustic and laid-back atmosphere and take home a handicraft or batik souvenir. [cite: 222]"
        },
        {
          "name": "Nearby Beaches (Teluk Chempedak, Balok)",
          [cite_start]"description": "Nearer to the town of Kuantan, these beaches are good for sailing, windsurfing and waterskiing when conditions are favourable. [cite: 225, 226]"
        }
      ],
      "activities": [
        [cite_start]"Catamaran sailing and kayaking. [cite: 219]",
        [cite_start]"Windsurfing and kite flying. [cite: 220]",
        [cite_start]"Cycling and exploring local eateries. [cite: 221]",
        [cite_start]"Turtle watching. [cite: 223]"
      ],
      "gettingThere": {
        [cite_start]"byRoad": "Cherating is a 4-hour drive from Kuala Lumpur. [cite: 228] [cite_start]Buses to Kuantan depart daily from Kuala Lumpur, from where taxi services are available to Cherating. [cite: 229]",
        "byAir": "Malaysia Airlines and Firefly provide frequent air services to Kuantan. [cite_start]From the airport, Cherating is just 45 minutes away. [cite: 231]"
      },
      "usefulContacts": [
        {
          "name": "Tourism Malaysia Regional Office East Coast",
          "phone": "609 567 7112/7115/7116"
        }
      ]
    },
    {
      "name": "Islands of Terengganu",
      [cite_start]"slogan": "TERENGGANU IS BLESSED WITH CAPTIVATING ISLAND RETREATS OF SOFT WHITE SAND, BREATHTAKING BLUE WATERS AND DAZZLING UNDERSEA GARDENS... AN UNFORGETTABLE PARADISE IN THE SOUTH CHINA SEA. [cite: 233]",
      [cite_start]"description": "Terengganu, on the east coast of Peninsular Malaysia, beckons with an aura that is distinctively Malay. [cite: 234] [cite_start]The islands of Redang, Perhentian, Lang Tengah, Kapas and Tenggol are jewels in Terengganu's crown. [cite: 236]",
      "attractions": [
        {
          "name": "Redang Island",
          [cite_start]"description": "Situated 45km off the coast of Kuala Terengganu, it is the largest of all Terengganu's islands. [cite: 237] [cite_start]It boasts two beautiful beaches, Pasir Panjang (Long Beach) and Teluk Dalam Kecil. [cite: 239]"
        },
        {
          "name": "Perhentian Islands (Besar and Kecil)",
          [cite_start]"description": "Lying about 21km off Terengganu's coastline, they are abound with exciting activities for sun-seekers and offer some of the best dive sites in the country. [cite: 248, 249, 250]"
        },
        {
          "name": "Lang Tengah Island",
          [cite_start]"description": "A 30-minute boat ride from Redang, its sparkling white sand and aquamarine waters are simply irresistible. [cite: 252, 253]"
        },
        {
          "name": "Kapas and Tenggol Islands",
          [cite_start]"description": "Delightful gems for divers with their scenic beaches, underwater rock formations and a plethora of marine life. [cite: 255]"
        }
      ],
      "activities": [
        [cite_start]"Snorkelling and diving. [cite: 245, 250]",
        [cite_start]"Sunbathing and strolling on the beach. [cite: 241, 242]"
      ],
      "gettingThere": {
        [cite_start]"general": "Travel along the East Coast Highway from Kuala Lumpur to Kuala Terengganu. [cite: 258]",
        "toPerhentian": "Take a two-hour drive to the town of Kuala Besut. [cite_start]Boats are available from Kuala Besut Jetty (20-30 minute ride). [cite: 259, 260]",
        "toRedangAndLangTengah": "The gateway town is Merang. [cite_start]From Merang Jetty, the ride to Pulau Redang takes about 45 minutes while Lang Tengah is about 1.5 hours away. [cite: 261, 262]",
        "toKapasAndGemia": "Accessible via Marang. [cite_start]The boat ride from Marang Jetty takes about 20 to 30 minutes. [cite: 264, 265]",
        "toTenggol": "Drive to the town of Kuala Dungun. [cite_start]From Kuala Dungun Jetty, the boat ride takes about 1.5 hours. [cite: 266, 267]",
        [cite_start]"byAir": "Malaysia Airlines, AirAsia, Malindo Air and Firefly provide direct air services from Kuala Lumpur to Kuala Terengganu and Kota Bharu. [cite: 268]"
      },
      "usefulContacts": [
        {
          "name": "Tourism Malaysia Regional Office East Coast",
          "phone": "609 5677112/7115/7116"
        }
      ]
    },
    {
      "name": "Sabah",
      "slogan": "THIS GATEWAY TO BORNEO SHOWCASES DIVERSE CULTURES, A TIMELESS RAINFOREST AND ANCIENT CAVES. [cite_start]ITS EXTENSIVE COASTLINE IS A PARADISE OF ALLURING BEACHES AND ISLAND RETREATS. [cite: 271]",
      [cite_start]"description": "Sabah is caressed by the South China Sea on its west and the Sulu and Celebes seas on its eastern coastline. [cite: 272] [cite_start]Kota Kinabalu, Sabah's capital, offers top-notched properties with spectacular views. [cite: 273, 274]",
      "attractions": [
        {
          "name": "Tunku Abdul Rahman Park",
          [cite_start]"description": "A treasured marine heritage, the five islands of the Tunku Abdul Rahman Park are surrounded by extensive coral reefs and are a popular playground for water sports. [cite: 278, 279]"
        },
        {
          "name": "Nexus Karambunai",
          [cite_start]"description": "A fabulous resort offering six kilometres of soft sandy beach, with activities like horse-riding, archery, and an 18-hole golf course. [cite: 280, 281, 282]"
        },
        {
          "name": "Shangri-La Rasa Ria",
          [cite_start]"description": "A splendid getaway surrounded by 400 acres of lush tropical vegetation, with a three-kilometer white sandy beach and a nature reserve. [cite: 284, 285, 287]"
        },
        {
          "name": "Mantanani Island",
          [cite_start]"description": "Blessed with ancient shipwrecks and an abundant marine life, the island has a beach stretching up to 2,500m. [cite: 296, 297]"
        },
        {
          "name": "Simpang Mengayau Bay (Tip of Borneo)",
          [cite_start]"description": "Located north of Kudat, this stretch of beach is excellent for swimming and to watch the sunrise and sunset. [cite: 301]"
        },
        {
          "name": "Diving Islands (Pulau Tiga, Layang Layang, Turtle Island, Mabul, Kapalai, Sipadan)",
          [cite_start]"description": "These islands are outstanding diving sites in the region. [cite: 302, 303]"
        }
      ],
      "activities": [
        [cite_start]"Water sports, swimming, snorkelling. [cite: 279]",
        [cite_start]"Golfing. [cite: 275, 282, 286]",
        [cite_start]"Jet-skiing, kayaking, mangrove cruises, and firefly cruises. [cite: 283, 286]",
        [cite_start]"Diving. [cite: 303]"
      ],
      "gettingThere": {
        [cite_start]"byAir": "Malaysia Airlines, the budget carrier AirAsia and several international carriers operate direct and connecting flights from Kuala Lumpur to Kota Kinabalu, Sandakan, Tawau and Labuan. [cite: 305]"
      },
      "usefulContacts": [
        {
          "name": "Tourism Malaysia Tourist Information Centre, Kota Kinabalu International Airport",
          "phone": "6088 413 359"
        }
      ]
    },
    {
      "name": "Sarawak",
      "slogan": "SARAWAK, LAND OF THE HORNBILLS, IS THE LARGEST STATE IN MALAYSIA. [cite_start]ITS COLOURFUL HISTORY, RICH CULTURES, SPECTACULAR NATURAL ATTRACTIONS AND FASCINATING WILDLIFE MAKE IT A RIVETING LAND OF ADVENTURES. [cite: 308]",
      [cite_start]"description": "Sarawak has a coastline that runs 700km along the northwestern side of Borneo. [cite: 309] [cite_start]A good place to begin discovering its beauty is Damai Beach in Santubong. [cite: 310] [cite_start]Miri is dubbed the 'gateway to adventure'. [cite: 324]",
      "attractions": [
        {
          "name": "Damai Beach, Santubong",
          [cite_start]"description": "This holiday spot is embraced by the South China Sea and has the majestic jungle-clad Mount Santubong as its backdrop. [cite: 311] [cite_start]Some of the state's best beach resorts are located here. [cite: 312]"
        },
        {
          "name": "Sarawak Cultural Village",
          [cite_start]"description": "A living museum showcasing the state's various ethnic cultures. [cite: 313]"
        },
        {
          "name": "Satang Islands (Besar and Kecil)",
          [cite_start]"description": "Just a 30-45 minutes' boat ride away from Damai Beach, these islands are sanctuaries for green turtles. [cite: 315]"
        },
        {
          "name": "National Parks (Tanjung Datu, Similajau, Bako)",
          [cite_start]"description": "Sarawak's national parks offer a host of adventures for eco-lovers, with beautiful beaches and unique wildlife like the long-nosed proboscis monkey. [cite: 317, 318, 319, 320, 321]"
        },
        {
          "name": "Miri Beaches (Luak Bay Esplanade, Hawaii Beach)",
          [cite_start]"description": "On the northernmost corner of Sarawak, the long stretches of beaches in Miri are a popular weekend getaway. [cite: 322, 323]"
        }
      ],
      "activities": [
        [cite_start]"Swimming and sunbathing. [cite: 314]",
        [cite_start]"Eco-tours and wildlife sighting. [cite: 317, 321]"
      ],
      "gettingThere": {
        [cite_start]"byAir": "Malaysia Airlines and the budget carrier AirAsia operate direct and connecting flights to Kuching, Miri, Bintulu and Sibu. [cite: 325] [cite_start]Kuching and Miri are also served by Malindo Air. [cite: 326]"
      },
      "usefulContacts": [
        {
          "name": "Tourism Malaysia Tourist Information Centre, Kuching International Airport",
          "phone": "6082 627 742"
        }
      ]
    }
  ],
  "generalInformation": {
    "title": "Malaysia at a Glance",
    [cite_start]"country": "The federation of Malaysia comprises Peninsular Malaysia, which is made up of 11 states, three Federal Territories as well as the states of Sabah and Sarawak situated in Borneo. [cite: 328]",
    [cite_start]"capitalCity": "Kuala Lumpur [cite: 329]",
    [cite_start]"geographicalLocation": "Lying 2 to 7º north of the Equator, Peninsular Malaysia is separated from Sabah and Sarawak by the South China Sea. [cite: 329] [cite_start]The Peninsular shares a common border with Thailand in the north, while its southern neighbour is Singapore. [cite: 330] [cite_start]Sabah and Sarawak share a common border with Indonesia while Sarawak also shares a border with Brunei Darussalam. [cite: 331]",
    [cite_start]"area": "329,758 sq km [cite: 332]",
    [cite_start]"timeZone": "The standard Malaysian time is eight hours ahead of GMT and 16 hours ahead of the U.S. Pacific Standard Time. [cite: 332]",
    [cite_start]"population": "33.4 million [cite: 333]",
    "people": "Malaysia has a diverse population. [cite_start]Its multicultural fabric is made up of the Malays, who form the majority of the population, as well as the Chinese, Indians, Portuguese Eurasians and Straits Chinese, along with the indigenous communities of Peninsular Malaysia and the ethnic groups of Sabah and Sarawak. [cite: 333]",
    [cite_start]"language": "Bahasa Malaysia (Malay) is the national language but English is widely spoken. [cite: 334]",
    [cite_start]"religion": "Islam is the official religion but all other religions are practised freely. [cite: 335]",
    [cite_start]"government": "Malaysia practices parliamentary democracy and constitutional monarchy. [cite: 335] [cite_start]The Head of State is the Yang di-Pertuan Agong and the Head of Government is the Prime Minister. [cite: 336]",
    [cite_start]"climate": "Malaysia has a tropical climate and the weather is warm all year round. [cite: 337] [cite_start]Temperatures range from 21°C to 32°C and the annual rainfall varies from 2,000 mm to 2,500 mm. [cite: 338]",
    [cite_start]"economy": "Manufacturing constitutes the largest component of Malaysia's economy while tourism and primary commodities such as petroleum, palm oil, natural rubber and timber are major contributors to its economy. [cite: 339]",
    [cite_start]"entryRequirements": "Visitors must be in possession of a valid passport or travel document with a minimum validity of six months beyond the intended visiting period. [cite: 340] [cite_start]Citizens of most countries do not require visas for social or business visits. [cite: 341]",
    "currency": {
      [cite_start]"unit": "Malaysian Ringgit (RM or MYR) [cite: 343]",
      [cite_start]"exchange": "Foreign currencies can be converted at banks and money changers. [cite: 344]",
      [cite_start]"paymentMethods": "Transactions can be carried out using the Malaysian currency or via credit cards and online banking services. [cite: 345] [cite_start]Cashless transactions such as e-wallets and mobile payments have grown in popularity. [cite: 346]"
    },
    [cite_start]"bankingHours": "In most states, banks are open from Monday to Friday from 9.15 am to 4.30 pm. [cite: 348] [cite_start]In Kelantan and Terengganu, banks are closed on Friday and Saturday. [cite: 349]",
    [cite_start]"workingDays": "Most states observe Monday to Friday as working days while Saturday and Sunday are rest days. [cite: 351] [cite_start]In the states of Johor, Kedah, Kelantan and Terengganu, working days are from Sunday to Thursday. [cite: 352]",
    [cite_start]"electricity": "The voltage used throughout Malaysia is 220-240 volts AC, at 50 cycles per second. [cite: 354] [cite_start]Standard 3-pin square plugs and sockets are used. [cite: 355]",
    [cite_start]"communications": "Malaysia is linked internationally via the Internet. [cite: 355] [cite_start]There is a stable 4G mobile network coverage in the country. [cite: 356] [cite_start]Wi-fi connection is available at most hotels, restaurants and transport terminals. [cite: 357] [cite_start]Travellers can easily get a local prepaid SIM card at airports or shopping malls. [cite: 358]",
    [cite_start]"gettingToMalaysia": "The main gateway to Malaysia is the Kuala Lumpur International Airport (KLIA) which is also known as KLIA Terminal 1. [cite: 360] [cite_start]Over 40 international airlines fly into the country via KLIA. [cite: 361] [cite_start]KLIA Terminal 2 serves as the world's largest terminal dedicated to low-cost carriers. [cite: 362] [cite_start]Other international airports are in Langkawi, Penang, Johor Bahru, Kota Kinabalu and Kuching. [cite: 363]",
    [cite_start]"gettingAround": "Malaysia has excellent domestic air links serviced by Malaysia Airlines as well as carriers such as AirAsia, Firefly and Batik Air. [cite: 366] [cite_start]The country has a well-developed and efficient public transportation system served by buses, taxis as well as trains. [cite: 367] [cite_start]GrabCar and other e-hailing services are available in Malaysia. [cite: 368]"
  },
  "contactInformation": {
    "headOffice": {
      "name": "Malaysia Tourism Promotion Board",
      "address": "9th Floor, No. 2, Tower 1, Jalan P5/6, Precinct 5, 62200 Putrajaya, Malaysia",
      "phone": "603 8891 8000",
      "infoline": "1 300 88 5050 (within Malaysia only)",
      "fax": "603 8891 8999",
      "email": "enquiries@tourism.gov.my",
      "website": "www.malaysia.travel"
    },
    "regionalOffices": [
      {
        "region": "Central Region (Kuala Lumpur, Selangor, Negeri Sembilan)",
        "address": "Level 2, MaTiC New Building, 109, Jalan Ampang, 50450 Kuala Lumpur",
        "phone": "603 21610166/0312/0328/0348"
      },
      {
        "region": "Southern Region (Melaka, Johor)",
        "address": "Suite 13-02, Level 13, Menara JLand, 80000 Johor Bahru, Johor.",
        "phone": "607-222 3590/3591"
      },
      {
        "region": "Northern Region (Perak, Penang, Kedah, Perlis)",
        "address": "No. 11, Lebuh Pantai, 10300 George Town, Penang",
        "phone": "604 261 0058"
      },
      {
        "region": "East Coast Region (Pahang, Terengganu, Kelantan)",
        "address": "Lot 7 & 9, Ground Floor, ICT Hub, Jalan Putra Square 4, Putra Square, 25200 Kuantan, Pahang",
        "phone": "609 567 7112/7115/7116"
      }
    ],
    "overseasOffices": [
      {"country": "Australia"},
      {"country": "Brunei"},
      {"country": "China"},
      {"country": "France"},
      {"country": "Germany"},
      {"country": "Hong Kong"},
      {"country": "India"},
      {"country": "Indonesia"},
      {"country": "Japan"},
      {"country": "Kazakhstan"},
      {"country": "Korea"},
      {"country": "Netherlands"},
      {"country": "New Zealand"},
      {"country": "Philippines"},
      {"country": "Russia"},
      {"country": "Saudi Arabia"},
      {"country": "Singapore"},
      {"country": "Taiwan"},
      {"country": "Thailand"},
      {"country": "Turkiye"},
      {"country": "United Arab Emirates"},
      {"country": "United Kingdom"},
      {"country": "United States of America"},
      {"country": "Vietnam"}
    ]
  }
}